---
kind: property
id: P:Autodesk.Revit.DB.Visual.Tile.TileEdgeRoughness
source: html/e283e22d-acb0-3a75-b404-7888a17c54f8.htm
---
# Autodesk.Revit.DB.Visual.Tile.TileEdgeRoughness Property

The property labeled "Roughness" from the "Tile" schema.

## Syntax (C#)
```csharp
public static string TileEdgeRoughness { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 200".